---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeServiceSizeWarning
source: html/85244bb3-6e6c-c7c9-b52e-bf57ccd8a8af.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeServiceSizeWarning Property

The selected fitting(s) cannot successfully change service or change size. You must disconnect the connections on the fitting(s) and try again.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartCannotChangeServiceSizeWarning { get; }
```